org/pages/algorithm/algorithm.org
#+title: Algorithm
#+STARTUP: showall indent
#+STARTUP: hidestars
#+TOC: nil  ;; Disable table of contents by default
#+OPTIONS: toc:nil  ;; Disable TOC in HTML export

#+BEGIN_EXPORT html
---
layout: default
title: Algorithm
nav_exclude: true
---
#+END_EXPORT

* [[file:segment_tree.org][Segment Tree]], [[file:fenwick_tree.org][Fenwick Tree]]
| Question                                 | Time              |
|------------------------------------------+-------------------|
| [[https://leetcode.com/problems/count-of-smaller-numbers-after-self/][315. Count of Smaller Numbers After Self]] | <2025-06-19 周四> |
| [[https://leetcode.com/problems/block-placement-queries/][3161. Block Placement Queries]]            | <2025-06-19 周四> |
| [[https://leetcode.com/problems/range-sum-query-mutable/description/][307. Range Sum Query - Mutable]]           | <2025-06-19 周四> |


* [[file:sliding_window.org][Sliding Window]]
| Question                                                         | Time              |
|------------------------------------------------------------------+-------------------|
| [[https://leetcode.com/problems/count-complete-subarrays-in-an-array/description/][2799. Count Complete Subarrays in an Array]]                       | <2025-06-19 周四> |
| [[https://leetcode.com/problems/count-subarrays-with-score-less-than-k/description/][2302. Count Subarrays With Score Less Than K]]                     | <2025-06-19 周四> |
| [[https://leetcode.com/problems/count-subarrays-where-max-element-appears-at-least-k-times/description/][2962. Count Subarrays Where Max Element Appears at Least K Times]] | <2025-06-19 周四> |

* Two Pointers
| Question                    | Time              |
|-----------------------------+-------------------|
| [[https://leetcode.com/problems/trapping-rain-water/description/][42. Trapping Rain Water]]     | <2025-06-19 周四> |
| [[https://leetcode.com/problems/trapping-rain-water-ii/description/][407. Trapping Rain Water II]] | <2025-06-19 周四> |


* [[file:prefix_suffix_sum.org][Prefix/Suffix Sum]]
| Question                             | Time              |
|--------------------------------------+-------------------|
| [[https://leetcode.com/problems/count-of-interesting-subarrays/description/][2845. Count of Interesting Subarrays]] | <2025-05-20 周二> |
| [[https://leetcode.com/problems/range-sum-query-immutable/description/][303. Range Sum Query - Immutable]]     | <2025-05-21 周三> |

* [[file:math.org][Math]]
** Modulo
| Question                             | Time              |
|--------------------------------------+-------------------|
| [[https://leetcode.com/problems/count-of-interesting-subarrays/description/][2845. Count of Interesting Subarrays]] | <2025-05-20 周二> |
|                                      |                   |
** Digits
| Question                      | Time              |
|-------------------------------+-------------------|
| [[https://leetcode.com/problems/next-greater-element-iii/description/][556. Next Greater Element III]] | <2025-05-21 周三> |
| [[https://leetcode.com/problems/reverse-integer/description/][7. Reverse Integer]]            | <2025-05-21 周三> |

** Permutation
| Question                           | Time              |
|------------------------------------+-------------------|
| [[https://leetcode.com/problems/next-permutation/description/][31. Next Permutation]]               | <2025-05-21 周三> |
| [[https://leetcode.com/problems/next-greater-element-iii/description/][556. Next Greater Element III]]      | <2025-05-21 周三> |
| [[https://leetcode.com/problems/build-array-from-permutation/description/][1920. Build Array from Permutation]] | <2025-05-24 周六> |
|                                    |                   |


* [[file:offline.org][Offline]]
| Question                                         | Time              |
|--------------------------------------------------+-------------------|
| [[https://leetcode.com/problems/find-building-where-alice-and-bob-can-meet/description/][2940. Find Building Where Alice and Bob Can Meet]] | <2025-05-25 周日> |

* [[file:binary_search.org][Binary Search]]
| Question                                     | Time              |
|----------------------------------------------+-------------------|
| [[https://leetcode.com/problems/maximum-number-of-tasks-you-can-assign/description/][2071. Maximum Number of Tasks You Can Assign]] | <2025-05-25 周日> |

