docs/pages/algorithm/algorithm.html
---
layout: default
title: Algorithm
nav_exclude: true
---
<div id="outline-container-orgf6e58e7" class="outline-2">
<h2 id="orgf6e58e7"><span class="section-number-2">1.</span> <a href="segment_tree.html">Segment Tree</a>, <a href="fenwick_tree.html">Fenwick Tree</a></h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-of-smaller-numbers-after-self/">315. Count of Smaller Numbers After Self</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-18 周日&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/block-placement-queries/">3161. Block Placement Queries</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-18 周日&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/range-sum-query-mutable/description/">307. Range Sum Query - Mutable</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-21 周三&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga3793d6" class="outline-2">
<h2 id="orga3793d6"><span class="section-number-2">2.</span> <a href="sliding_window.html">Sliding Window</a></h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-complete-subarrays-in-an-array/description/">2799. Count Complete Subarrays in an Array</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-14 周三&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-subarrays-with-score-less-than-k/description/">2302. Count Subarrays With Score Less Than K</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-14 周三&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-subarrays-where-max-element-appears-at-least-k-times/description/">2962. Count Subarrays Where Max Element Appears at Least K Times</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-18 周日&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge577ab4" class="outline-2">
<h2 id="orge577ab4"><span class="section-number-2">3.</span> Two Pointers</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/trapping-rain-water/description/">42. Trapping Rain Water</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-20 周二&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/trapping-rain-water-ii/description/">407. Trapping Rain Water II</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-20 周二&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0f39cb7" class="outline-2">
<h2 id="org0f39cb7"><span class="section-number-2">4.</span> <a href="prefix_suffix_sum.html">Prefix/Suffix Sum</a></h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-of-interesting-subarrays/description/">2845. Count of Interesting Subarrays</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-20 周二&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/range-sum-query-immutable/description/">303. Range Sum Query - Immutable</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-21 周三&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge099252" class="outline-2">
<h2 id="orge099252"><span class="section-number-2">5.</span> <a href="math.html">Math</a></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org92ed837" class="outline-3">
<h3 id="org92ed837"><span class="section-number-3">5.1.</span> Modulo</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-of-interesting-subarrays/description/">2845. Count of Interesting Subarrays</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-20 周二&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc04cf22" class="outline-3">
<h3 id="orgc04cf22"><span class="section-number-3">5.2.</span> Digits</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/next-greater-element-iii/description/">556. Next Greater Element III</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-21 周三&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/reverse-integer/description/">7. Reverse Integer</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-21 周三&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org218b976" class="outline-3">
<h3 id="org218b976"><span class="section-number-3">5.3.</span> Permutation</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/next-permutation/description/">31. Next Permutation</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-21 周三&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/next-greater-element-iii/description/">556. Next Greater Element III</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-21 周三&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/build-array-from-permutation/description/">1920. Build Array from Permutation</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-24 周六&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgb91edc2" class="outline-2">
<h2 id="orgb91edc2"><span class="section-number-2">6.</span> <a href="offline.html">Offline</a></h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/find-building-where-alice-and-bob-can-meet/description/">2940. Find Building Where Alice and Bob Can Meet</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-25 周日&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4184062" class="outline-2">
<h2 id="org4184062"><span class="section-number-2">7.</span> <a href="binary_search.html">Binary Search</a></h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/maximum-number-of-tasks-you-can-assign/description/">2071. Maximum Number of Tasks You Can Assign</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-25 周日&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
