org/pages/algorithm/algorithm.org
* [[file:monotonic_stack.org][Monotonic Stack]]
| Question                      | Time              |
|-------------------------------+-------------------|
| [[https://leetcode.com/problems/next-greater-element-i/description/][496. Next Greater Element I]]   | <2025-06-07 周六> |
| [[https://leetcode.com/problems/trapping-rain-water/description/][42. Trapping Rain Water]]       | <2025-06-07 周六> |
| [[https://leetcode.com/problems/next-greater-element-ii/description/][503. Next Greater Element II]]  | <2025-06-07 周六> |
| [[https://leetcode.com/problems/sum-of-subarray-minimums/description/][907. Sum of Subarray Minimums]] | <2025-06-07 周六> |


* TODO Backtracking

* Simulation
| Question           | Time              |
|--------------------+-------------------|
| [[https://leetcode.com/problems/push-dominoes/description/][838. Push Dominoes]] | <2025-06-07 周六> |

* Tricks
| Question                                     | Time              | Discussion |
|----------------------------------------------+-------------------+------------|
| [[https://leetcode.com/problems/minimum-domino-rotations-for-equal-row/description/][1007. Minimum Domino Rotations For Equal Row]] | <2025-05-03 周六> | [[file:discussion/leetcode1007.org][link]]       |
|                                              |                   |            |

* TODO [[file:graph/graph.org][Graph]]
** [[file:graph/DFS.org][DFS]]
** TODO [[file:graph/shortest_path.org][shortest path]]
| Question                                      | Time              |
|-----------------------------------------------+-------------------|
| [[https://leetcode.com/problems/find-minimum-time-to-reach-last-room-i/description/][3341. Find Minimum Time to Reach Last Room I]]  | <2025-05-18 周日> |
| [[https://leetcode.com/problems/find-minimum-time-to-reach-last-room-ii/][3342. Find Minimum Time to Reach Last Room II]] | <2025-05-11 周日> |

** [[file:connected_components.org][Connected Components]]
| Question                                  | Time              |
|-------------------------------------------+-------------------|
| [[https://leetcode.com/problems/path-existence-queries-in-a-graph-i/description/][3532. Path Existence Queries in a Graph I]] | <2025-05-25 周日> |
| [[https://leetcode.com/problems/number-of-islands/description/][200. Number of Islands]]                    | <2025-04-30 周三> |


** TODO [[file:graph/topological_sort.org][Topological Sort]]
** TODO [[file:graph/tree.org][Tree]]
** [[file:graph/cycle.org][Cycle]]
| Question                                 | Time              |
|------------------------------------------+-------------------|
| [[https://leetcode.com/problems/build-array-from-permutation/description/][1920. Build Array from Permutation]]       | <2025-05-06 周二> |
| [[https://leetcode.com/problems/minimum-swaps-to-sort-by-digit-sum/description/][3551. Minimum Swaps to Sort by Digit Sum]] | <2025-05-17 周六> |
|                                          |                   |

* [[file:dp/dp.org][Dynamic Programming]]
| Question                                                 | Time              | Topics Covered                          |
|----------------------------------------------------------+-------------------+-----------------------------------------|
| [[https://leetcode.com/problems/count-partitions-with-max-min-difference-at-most-k/description/][3578. Count Partitions With Max-Min Difference at Most K]] | <2025-06-08 周日> | DP, Mono Stack, Sliding Window, Modular |

** [[file:dp/state_machine_dp.org][State Machine + DP]]



* string
** [[file:string/trie.org][Trie]]

* Company Tag
