docs/pages/algorithm/algorithm.html
<div id="outline-container-orgff9887e" class="outline-2">
<h2 id="orgff9887e"><span class="section-number-2">8.</span> <a href="monotonic_stack.html">Monotonic Stack</a></h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/next-greater-element-i/description/">496. Next Greater Element I</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-07 周六&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/trapping-rain-water/description/">42. Trapping Rain Water</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-07 周六&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/next-greater-element-ii/description/">503. Next Greater Element II</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-07 周六&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/sum-of-subarray-minimums/description/">907. Sum of Subarray Minimums</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-07 周六&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8d8ded4" class="outline-2">
<h2 id="org8d8ded4"><span class="section-number-2">9.</span> <span class="todo TODO">TODO</span> Backtracking</h2>
</div>

<div id="outline-container-org6f74ad2" class="outline-2">
<h2 id="org6f74ad2"><span class="section-number-2">10.</span> Simulation</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/push-dominoes/description/">838. Push Dominoes</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-07 周六&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org14ee7ff" class="outline-2">
<h2 id="org14ee7ff"><span class="section-number-2">11.</span> Tricks</h2>
<div class="outline-text-2" id="text-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Discussion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/minimum-domino-rotations-for-equal-row/description/">1007. Minimum Domino Rotations For Equal Row</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-03 周六&gt;</span></span></td>
<td class="org-left"><a href="discussion/leetcode1007.html">link</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4616a2d" class="outline-2">
<h2 id="org4616a2d"><span class="section-number-2">12.</span> <span class="todo TODO">TODO</span> <a href="graph/graph.html">Graph</a></h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgdd57760" class="outline-3">
<h3 id="orgdd57760"><span class="section-number-3">12.1.</span> <a href="graph/DFS.html">DFS</a></h3>
</div>
<div id="outline-container-org664ceb9" class="outline-3">
<h3 id="org664ceb9"><span class="section-number-3">12.2.</span> <span class="todo TODO">TODO</span> <a href="graph/shortest_path.html">shortest path</a></h3>
<div class="outline-text-3" id="text-12-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/find-minimum-time-to-reach-last-room-i/description/">3341. Find Minimum Time to Reach Last Room I</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-18 周日&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/find-minimum-time-to-reach-last-room-ii/">3342. Find Minimum Time to Reach Last Room II</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-11 周日&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org07d2db3" class="outline-3">
<h3 id="org07d2db3"><span class="section-number-3">12.3.</span> <a href="connected_components.html">Connected Components</a></h3>
<div class="outline-text-3" id="text-12-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/path-existence-queries-in-a-graph-i/description/">3532. Path Existence Queries in a Graph I</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-25 周日&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/number-of-islands/description/">200. Number of Islands</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-30 周三&gt;</span></span></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd745650" class="outline-3">
<h3 id="orgd745650"><span class="section-number-3">12.4.</span> <span class="todo TODO">TODO</span> <a href="graph/topological_sort.html">Topological Sort</a></h3>
</div>
<div id="outline-container-org6799f88" class="outline-3">
<h3 id="org6799f88"><span class="section-number-3">12.5.</span> <span class="todo TODO">TODO</span> <a href="graph/tree.html">Tree</a></h3>
</div>
<div id="outline-container-org2e34473" class="outline-3">
<h3 id="org2e34473"><span class="section-number-3">12.6.</span> <a href="graph/cycle.html">Cycle</a></h3>
<div class="outline-text-3" id="text-12-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/build-array-from-permutation/description/">1920. Build Array from Permutation</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-06 周二&gt;</span></span></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/minimum-swaps-to-sort-by-digit-sum/description/">3551. Minimum Swaps to Sort by Digit Sum</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-05-17 周六&gt;</span></span></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org453ce3e" class="outline-2">
<h2 id="org453ce3e"><span class="section-number-2">13.</span> <a href="dp/dp.html">Dynamic Programming</a></h2>
<div class="outline-text-2" id="text-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Topics Covered</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/count-partitions-with-max-min-difference-at-most-k/description/">3578. Count Partitions With Max-Min Difference at Most K</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-08 周日&gt;</span></span></td>
<td class="org-left">DP, Mono Stack, Sliding Window, Modular</td>
</tr>
</tbody>
</table>
</div>
