org/pages/algorithm/algorithm.org
** Google
| Question                                | Time              |                    |
|-----------------------------------------+-------------------+--------------------|
| [[https://leetcode.com/problems/add-two-numbers/description/?envType=company&envId=google&favoriteSlug=google-thirty-days][2. Add Two Numbers]]                      | <2025-06-13 周五> |                    |
| [[https://leetcode.com/problems/palindrome-number/description/?envType=company&envId=google&favoriteSlug=google-thirty-days][9. Palindrome Number]]                    | <2025-06-13 周五> | Corner cases       |
| [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock/description/?envType=company&envId=google&favoriteSlug=google-thirty-days][121. Best Time to Buy and Sell Stock]]    | <2025-06-13 周五> |                    |
| [[https://leetcode.com/problems/best-time-to-buy-and-sell-stock-ii/description/][122. Best Time to Buy and Sell Stock II]] | <2025-06-14 周六> | [[file:dp/state_machine_dp.org][State Machine + DP]] |
| [[https://leetcode.com/problems/maximize-subarray-gcd-score/description/][3574. Maximize Subarray GCD Score]]       | <2025-06-15 周日> |                    |
