docs/pages/algorithm/algorithm.html
<div id="outline-container-org9450aa7" class="outline-3">
<h3 id="org9450aa7"><span class="section-number-3">13.1.</span> <a href="dp/state_machine_dp.html">State Machine + DP</a></h3>
</div>
</div>
<div id="outline-container-org901ed63" class="outline-2">
<h2 id="org901ed63"><span class="section-number-2">14.</span> string</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org2b0b76b" class="outline-3">
<h3 id="org2b0b76b"><span class="section-number-3">14.1.</span> <a href="string/trie.html">Trie</a></h3>
</div>
</div>
<div id="outline-container-orgb4a8c67" class="outline-2">
<h2 id="orgb4a8c67"><span class="section-number-2">15.</span> Company Tag</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org31e5060" class="outline-3">
<h3 id="org31e5060"><span class="section-number-3">15.1.</span> Google</h3>
<div class="outline-text-3" id="text-15-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://leetcode.com/problems/add-two-numbers/description/?envType=company&amp;envId=google&amp;favoriteSlug=google-thirty-days">2. Add Two Numbers</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-13 周五&gt;</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/palindrome-number/description/?envType=company&amp;envId=google&amp;favoriteSlug=google-thirty-days">9. Palindrome Number</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-13 周五&gt;</span></span></td>
<td class="org-left">Corner cases</td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/best-time-to-buy-and-sell-stock/description/?envType=company&amp;envId=google&amp;favoriteSlug=google-thirty-days">121. Best Time to Buy and Sell Stock</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-13 周五&gt;</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/best-time-to-buy-and-sell-stock-ii/description/">122. Best Time to Buy and Sell Stock II</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-14 周六&gt;</span></span></td>
<td class="org-left"><a href="dp/state_machine_dp.html">State Machine + DP</a></td>
</tr>

<tr>
<td class="org-left"><a href="https://leetcode.com/problems/maximize-subarray-gcd-score/description/">3574. Maximize Subarray GCD Score</a></td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-06-15 周日&gt;</span></span></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
